{
    "title": "Amazon API Gateway to Amazon SQS to AWS Lambda to Amazon DynamoDB",
    "description": "This pattern explains how to deploy a SAM application with Amazon API Gateway, Amazon SQS, AWS Lambda, and Amazon DynamoDB. When an HTTP POST request is made to the Amazon API Gateway endpoint, Gateway authorizes the request by checking Basic auth credentials and on valid credentials, request payload is sent to Amazon Simple Queue Service. AWS Lambda function consumes event from the Queue and inserts the event/payload into the Amazon DynamoDB table. Amazon Simple Queue Service is also configured with a Dead Letter Queue where events are sent when retries to process those messages are repeatedly failed.",
    "language": "Python",
    "level": "300",
    "framework": "SAM",
    "introBox": {
        "headline": "How it works",
        "text": [
            "This pattern deploys an Amazon API Gateway HTTP API with route /submit configured with basic authentication.",
            "On receiving a request, API Gateway will invoke a Lambda authorizer which validates the request and returns a policy informing API Gateway to accept or deny the request.",
            "When request is accepted, API Gateway sends the message payload to a queue in SQS. SQS uses another queue as Dead Letter Queue to send the messages in case of continued failures to process the messages from downstream lambda.",
            "Messages from SQS is posted to a lambda function to process them.",
            "Lambda function receives the messages from SQS and saves them into a DynamoDB table."
        ]
    },
    "gitHub": {
        "template": {
            "repoURL": "https://github.com/aws-samples/serverless-patterns/tree/main/apigw-sqs-lambda-ddb",
            "templateURL": "serverless-patterns/apigw-sqs-lambda-ddb",
            "projectFolder": "apigw-sqs-lambda-ddb",
            "templateFile": "apigw-sqs-lambda-ddb/template.yaml"
        }
    },
    "resources": {
        "bullets": [
            {
                "text": "Lambda Authorizers",
                "link": "https://docs.aws.amazon.com/apigateway/latest/developerguide/apigateway-use-lambda-authorizer.html"
            },
            {
                "text": "Amazon SQS dead-letter queues",
                "link": "https://docs.aws.amazon.com/AWSSimpleQueueService/latest/SQSDeveloperGuide/sqs-dead-letter-queues.html"
            },
            {
                "text": "Working with HTTP APIs",
                "link": "https://docs.aws.amazon.com/apigateway/latest/developerguide/http-api.html"
            }
        ]
    },
    "deploy": {
        "text": [
            "sam deploy"
        ]
    },
    "testing": {
        "text": [
            "See the GitHub repo for detailed testing instructions."
        ]
    },
    "cleanup": {
        "text": [
            "Delete the stack: <code>sam delete</code>."
        ]
    },
    "authors": [
        {
            "name": "Ravi Kiran Ganji",
            "bio": "I am a Senior Cloud Application Architect at AWS Professional Services, and Serverless Enthusiast.",
            "linkedin": "ravi-kiran-ganji"
        }
    ]
}