{
    "text":"Luigi's Mansion is a 2001 action-adventure game developed and published by Nintendo. The game was a launch title for the GameCube and was the first game in the Mario franchise to be released for the console; it was released in Japan on September 14, 2001, in North America on November 18, 2001, in Europe on May 3, 2002, and in Australia on May 17, 2002. It is the second video game in which Luigi is the main character instead of Mario, after Mario Is Missing!. Players control him as he explores a haunted mansion, searches for Mario and deals with ghosts by capturing them through a vacuum cleaner supplied by Professor E. Gadd. Luigi's Mansion received a positive critical reception overall, with reviewers praising the gameplay, setting, and soundtrack, though its short length was criticized. The game has sold over 3.3 million copies, and is the fifth-best-selling GameCube game of all time. It was one of the first games to be re-released as a Player's Choice title on the system, and achieved a cult following.[1] The game was followed by two sequels – Luigi's Mansion: Dark Moon, released for the Nintendo 3DS in 2013, and Luigi's Mansion 3, which was released for the Nintendo Switch in 2019. A remake of Luigi's Mansion for the 3DS, co-developed by Nintendo and Grezzo, was released in 2018. Gameplay Beta screenshot of Luigi capturing Neville, the game's first 'portrait ghost', using the Poltergust 3000. The number represents the ghost's HP, which must be reduced to zero in order for Luigi to capture it. Luigi's Mansion's story takes place over four 'areas', or sets of explorable rooms between boss fights. Players may also access a training room and a gallery at Professor E. Gadd's laboratory between areas or upon starting the game.[2] In each area, players control Luigi to explore the mansion's rooms and hunt down the ghosts within them, acquiring keys to get through locked doors and eventually fighting a boss ghost at the end of the area. To assist him in his task, Luigi uses a flashlight and two inventions supplied by E. Gadd – the Poltergust 3000, a specially modified, high-powered vacuum cleaner; and the Game Boy Horror, a play on Nintendo's Game Boy Color. To capture ghosts, Luigi must first stun a ghost with his flashlight, revealing its heart. He then must use the Poltergust 3000 to suck them up, steadily reducing the ghost's hit points to zero, at which point they are captured. The more hit points, the more time it takes for a ghost to be captured, giving them a chance to break free while leaving Luigi more exposed to harm. If Luigi's HP is reduced to zero from being hurt by the ghosts or other accidents, the game is over.[3] Along his journey, Luigi locates three elemental medals, each granting the Poltergust with the ability to summon and vacuum ghosts from fire, water, and ice sources and expel their respective elements to capture specific ghosts or solve puzzles.[4] In addition to capturing the regular ghosts in the mansion, Luigi must catch 'portrait ghosts' from some rooms, each requiring a condition be met to make them available for capture. Rooms are usually dark upon initial access, and Luigi hums nervously to the music, but once all the ghosts are captured, it brightens up, and Luigi pleasantly whistles the melody. Using the Game Boy Horror, players can access a map of the mansion, seeing which rooms they have visited, what doors are open, and which remain locked. When Luigi finds a key during his explorations, the Game Boy Horror automatically indicates which door it unlocks.[5] In addition to a map function, the device keeps track of any treasure that Luigi has found. Rooms will usually have treasure hidden within, which can be either coins, bills, gold bars, or gems, hidden within objects and even in chests that appear when rooms are cleared. Luigi can gather these treasures by walking into them or vacuuming them; if a ghost harms Luigi, he will drop a few coins that he will need to recover before they disappear. After Luigi encounters a group of Boos hiding in the mansion, the GB Horror can be used to find each one hiding in a room through a beeper sound and a flashing yellow light on the device, which turns red when Luigi is close to one. Boos can only be located in cleared rooms.[5] Boos are trickier to catch, as they can plant decoys and traps within objects they can hide in that can fool the GB Horror and will escape into other rooms if they can. Once an area is completed, all portrait ghosts are restored to their paintings by E. Gadd, which the player can view in his laboratory's gallery,[6] at which point a result screen reveals the portrait ghosts Luigi has managed to capture, along with the total amount of treasure he recovered for that stage. Once the final boss of Luigi's Mansion is defeated, the player is given a rating (A to H) during the end credits based on the amount of treasure Luigi has found. Completing the game once unlocks a second mode called the 'Hidden Mansion', which features a stronger Poltergust and stronger ghosts. In the European version of this mode, the mansion appears as a mirrored reflection of the previous version, bosses are more difficult, ghosts and Portrait Ghosts are trickier to capture, and more ghosts appear in some of the rooms.[7] Plot Luigi has been notified about winning a mansion in a contest he did not enter. He informs Mario and they agree to meet up outside the mansion that evening. Luigi follows a map to the mansion, located in a dark forest, and finds it more sinister-looking than the supplied photo. With Mario nowhere to be found, Luigi enters the mansion alone. He encounters a ghost, which attacks him, but is unexpectedly saved by a scientist who unsuccessfully tries to suck up the ghost with a vacuum cleaner. They escape as more ghosts appear, and the scientist introduces himself as Professor Elvin Gadd, or E. Gadd for short. He explains the mansion is supernatural in origin and only appeared a few days prior.[2][8] E. Gadd tells Luigi that he saw Mario heading towards the mansion, but has not seen him since.[9] Upon learning that Mario is Luigi's brother, E. Gadd entrusts Luigi with his ghost-hunting equipment, including the Poltergust 3000 vacuum cleaner and Game Boy Horror communication device, and Luigi re-enters the mansion to look for Mario.[10] As Luigi explores the mansion, he discovers that it is an illusion built by King Boo to shelter the now-freed special ghosts that E. Gadd had previously captured and turned into paintings with a large machine dubbed the 'Ghost Portrificationizer'; King Boo subsequently created the false contest to lure the Mario Bros. into a trap in retaliation for the boos they defeated in the past. After recapturing many ghosts and working his way through the mansion, Luigi confronts King Boo, who has turned Mario into a painting. King Boo pulls Luigi into the painting for their final battle, using a suit-like copy of Bowser to combat him in an arena resembling the mansion's roof.[11] Finding a way to blast the suit's head off, Luigi catches King Boo and escapes the painting.[12] E. Gadd turns King Boo into a painting along with the recaptured ghosts, while Luigi uses the Ghost Portrificationizer's reverse function to free Mario.[13] After the mansion disappears, E. Gadd uses the treasure Luigi collected on his adventure to build him a new non-haunted house in its place. Its size depends on how much treasure the player gathered during the game. Development The game was revealed at Nintendo Space World 2000 as a technological demo designed to show off the graphical capabilities of the GameCube.[14] The full motion video footage had scenes seen in later trailers and commercials for the game, but were not used in the final release. This footage includes Luigi screaming in horror at the camera, running from an unknown ghost in the Foyer, ghosts playing cards in the Parlor, ghosts circling around Luigi, and a gloomy-looking Luigi standing outside the mansion with lightning flashing. These were animated at three graphic houses to pay homage to the GameCube. Soon after its creation, Nintendo decided to transform the demo into a full-fledged video game. A year later, Luigi's Mansion was shown at the Electronic Entertainment Expo alongside the GameCube console. Development was led by Hideki Konno, Shigeru Miyamoto, and Takashi Tezuka.[15] A newer version of the game, more closely related to the final version, was revealed at Nintendo Space World 2001.[16] The original plan for Luigi's Mansion involved a game where the levels revolved around a large mansion or complex. Tests were later done with Mario characters in dollhouses and such. Once it was transitioned into a GameCube project, Luigi was selected as the main character in order to keep the game original and new. The other gameplay ideas, such as ghosts and the ghost-sucking vacuum cleaner, were added later. Older concepts, such as a role-playing game-like system which made real-time changes to rooms, as well as a cave area located under the mansion, were scrapped due to the inclusion of the new ideas.[17] Luigi's Mansion's music was composed by Shinobu Tanaka and Kazumi Totaka,[18] and as such contains 'Totaka's Song', a song featured in almost every game that Totaka has composed.[19] It is found by waiting on the controller configuration screen at the Training Room for about three and a half minutes.[20] The main theme of Luigi's Mansion was orchestrated and arranged by Shogo Sakai for Super Smash Bros. Brawl.[21] The game featured voice actors Charles Martinet as the voice of Mario and Luigi, and Jen Taylor as the voice of Toad.[22] Luigi's Mansion received an award for its audio by BAFTA Interactive Entertainment Awards in 2002.[23] All GameCube systems support the display of stereoscopic 3D, and Luigi's Mansion was planned to utilize this feature;[24] however, 3D televisions were not widespread at the time, and it was deemed that compatible displays would be too cost-prohibitive for the consumer. As a result, the feature was not enabled outside of development.[25]"
}
