{
    "text":"The Legend of Zelda  is an action-adventure game franchise created by the Japanese game designers Shigeru Miyamoto and Takashi Tezuka. It is primarily developed and published by Nintendo, although some portable installments and re-releases have been outsourced to Flagship, Vanpool, and Grezzo. The gameplay incorporates action-adventure and elements of action RPG games.  The series centers on the various incarnations of Link, a courageous young man of the elf-like Hylian race, and Princess Zelda, a magical princess who is the mortal reincarnation of the goddess Hylia, as they fight to save the magical land of Hyrule from Ganon, an evil warlord turned demon king, who is the principal antagonist of the series. Ganon wishes to use the Triforce, a sacred relic left behind by the three goddesses that created Hyrule, to remake the world in his own dark image. When gathered together, the power of the Triforce can grant any wish its user desires; however, if someone with a heart that does not possess a balance of the three virtues of Power, Courage, and Wisdom attempts to touch the Triforce, it will split into three triangles and bond with three people whose hearts embody the required virtue.  Although their personalities and backstory differ from game to game, the incarnations of Link and Zelda often have many traits in common, such as Link often being left-handed and clad in green, and Zelda being associated with wisdom, light, and prophesy. While the conflict with Ganon serves as a backbone for the series, some games have featured other settings and antagonists, with Link traveling or being sent to these other lands in their time of need.  Since the original Legend of Zelda was released in 1986, the series has expanded to include 19 entries on all of Nintendo's major game consoles, as well as a number of spin-offs. An American animated TV series based on the games aired in 1989 and individual manga adaptations commissioned by Nintendo have been produced in Japan since 1997. The Legend of Zelda is one of Nintendo's most successful franchises; several of its entries are considered among the greatest video games of all time.  Gameplay  Rupees, the fictional currency in the series The Legend of Zelda games feature a mix of puzzles, action, adventure/battle gameplay, and exploration. These elements have remained constant throughout the series, but with refinements and additions featured in each new game. Later games in the series also include stealth gameplay, where the player must avoid enemies while proceeding through a level, as well as racing elements. Although the games can be beaten with a minimal amount of exploration and side quests, the player is frequently rewarded with helpful items or increased abilities for solving puzzles or exploring hidden areas. Some items are consistent and appear many times throughout the series (such as bombs and bomb flowers, which can be used both as weapons and to open blocked or hidden doorways; boomerangs, which can kill or paralyze enemies; keys for locked doors; magic swords, shields, and bows and arrows), while others are unique to a single game. Though the games contain role-playing elements (Zelda II: The Adventure of Link is the only one to include an experience system), they emphasize straightforward hack-and-slash-style combat over the strategic, turn-based or active time combat of series like Final Fantasy. The game's role-playing elements, however, have led to much debate over whether or not the Zelda games should be classified as action role-playing games, a genre on which the series has had a strong influence.[1] Miyamoto himself disagreed with the RPG label, but classified Zelda as 'a real-time adventure game'; he said he was 'not interested in systems where everything in the game is decided by stats and numbers' but what's 'important to me is to preserve as much of that “live” feeling as possible' which he said 'action games are better suited in conveying' to players.[2]   The Legend of Zelda often includes nonlinear gameplay and varying environments in an explorable world, similar to this illustration. Every game in the main Zelda series has consisted of three principal areas: an overworld which connects all other areas, in which movement is multidirectional, allowing the player some degree of freedom of action; areas of interaction with other characters (merely caves or hidden rooms in the first game, but expanding to entire towns and cities in subsequent games) in which the player gains special items or advice, can purchase equipment or complete side quests; and dungeons, areas of labyrinthine layout, usually underground, comprising a wide range of difficult enemies, bosses, and items. Each dungeon usually has one major item inside, which can be essential for solving many of the puzzles within that dungeon and often plays a crucial role in defeating that dungeon's boss, as well as progressing through the game. In nearly every Zelda game, navigating a dungeon is aided by locating a map, which reveals its layout, and a magic compass, which reveals the location of significant and smaller items such as keys and equipment. In later games, the dungeon includes a special 'big key' that will unlock the door to battle the dungeon's boss enemy and open the item chest.  In most Zelda games, the player's HP or life meter is represented by a line of hearts, each heart typically representing two hit points. At the start of the game the player only has three hearts but players can increase their max hearts by finding heart-shaped crystals called 'Heart Containers'. Full heart containers are usually received at the end of dungeons and dropped by dungeon bosses. Smaller 'Pieces of Heart' are awarded for completing side quests or found hidden around the game world in various places, and require a certain number (usually four) to form a full heart container. Health can be replenished by picking up hearts left by defeated enemies or destroyed objects, consuming items such as potions or food, or going to a Great Fairy Fountain to have the Great Fairy heal Link completely. Occasionally the player will find fairies hidden in specific locations; these fairies can either heal Link immediately or be kept in empty bottles, and will revive the player the next time they die.  The games pioneered a number of features that were to become industry standards. The original Legend of Zelda was the first console game with a save function that enabled players to stop playing and then resume later. The Legend of Zelda: Ocarina of Time introduced a targeting system that let the player lock the camera on to enemy or friendly NPCs which simplified 3D combat.  Inspiration  Shigeru Miyamoto, series creator, was inspired by the hillsides, forests, and caves surrounding his childhood home in Sonobe, Japan. The Legend of Zelda was principally inspired by Shigeru Miyamoto's 'explorations' as a young boy in the hillsides, forests, and caves surrounding his childhood home in Sonobe, Japan where he ventured into forests with secluded lakes, caves, and rural villages. According to Miyamoto, one of his most memorable experiences was the discovery of a cave entrance in the middle of the woods.[3] After some hesitation, he apprehensively entered the cave, and explored its depths with the aid of a lantern. Miyamoto has referred to the creation of the Zelda games as an attempt to bring to life a 'miniature garden' for players to play with in each game of the series.[4]  The story and setting was developed by Takashi Tezuka. Seeking to create a fairytale adventure game, Tezuka drew inspirations from fantasy books such as J. R. R. Tolkien's The Lord of the Rings.[5][6] According to Keiji Terui, who wrote the backstory in the first game's manual, the location named Death Mountain was initially a working title for the legend of the Triforce which was written with inspirations from the battles of medieval Europe.[7] The Master Sword was introduced as Excalibur in the French version of A Link to the Past,[8] which originates from the legend of King Arthur in the Welsh collection of Mabinogion.[9] Celtic mythology also inspired the name of Link's steed, Epona, based on the Celtic goddess of fertility.[10]  Hearing of American novelist, socialite and painter Zelda Fitzgerald, Miyamoto thought the name sounded 'pleasant and significant'.[11] Paying tribute, he chose to name the princess after her, and titled it The Legend of Zelda. Link and the fairy were inspired by Peter Pan and Tinker Bell.[12][13] When making the series made the transition to 3D, the combat system of Ocarina of Time was based on the chanbara (samurai) style of Japanese sword fighting.[14]  Audio  Koji Kondo, the series's original composer Games in The Legend of Zelda series frequently feature in-game musical instruments, particularly in musical puzzles, which are widespread.[15] Often, instruments trigger game events: for example, the recorder in The Legend of Zelda can reveal secret areas, as well as warp Link to the Dungeon entrances. This warping with music feature has also been used in A Link to the Past and Link's Awakening. In Ocarina of Time, playing instruments is a core part of the game, with the player needing to play the instrument through the use of the game controller to succeed.[16] Ocarina of Time is '[one of the] first contemporary non-dance title[s] to feature music-making as part of its gameplay',[17] using music as a heuristic device and requiring the player to utilise songs to progress in the game[18] – a game mechanic that is also present in Majora's Mask.[19]  'The Legend of Zelda Theme' is a recurring piece of music that was created for the first game of the franchise. The composer and sound director of the series, Koji Kondo, initially planned to use Maurice Ravel's Boléro as the game's title theme, but was forced to change it when he learned, late in the game's development cycle, that the copyright for the orchestral piece had not yet expired. As a result, Kondo wrote a new arrangement of the overworld theme within one day.[20] The 'Zelda Theme' has topped ScrewAttack's 'Top Ten Videogame Themes Ever' list.[21]  Up until Breath of the Wild, the Legend of Zelda series avoided using voice acting in speaking roles, relying instead on written dialogue. Series producer Eiji Aonuma previously stated that as Link is entirely mute, having the other characters speak while Link remains silent 'would be off-putting'.[22] Instead of theme music for different locations, Breath of the Wild plays natural ambience around the player as main sounds, in addition to some minimalist piano music.[23]  Plot Setting Main article: Universe of The Legend of Zelda Maps of Hyrule  Map of Hyrule, as seen in Ocarina of Time (legend in French)  Map of Hyrule, as seen in Breath of the Wild (legend in Spanish) The Legend of Zelda takes place predominantly in a medieval Western Europe-inspired fantasy world called Hyrule,[24] which has developed a deep history and wide geography over the series's many releases. Much of the backstory of the creation of Hyrule was revealed in the games A Link to the Past, Ocarina of Time, The Wind Waker, Twilight Princess, Skyward Sword, and A Link Between Worlds. Hyrule's principal inhabitants are pointy-eared, elf-like humanoids called Hylians, which include the player character, Link, and the eponymous princess, Zelda.  The fictional universe established by the Zelda games sets the stage for each adventure. Some games take place in different lands with their own back-stories. Hytopia is a connected kingdom,[25] Labrynna and Holodrum are different countries separate from the Kingdom of Hyrule, Termina and Lorule serve as parallel worlds,[26] and Koholint is an island far away from Hyrule that appears to be part of a dream.[27]  Story  The Triforce is represented as three conjoined golden triangles. According to the in-game backstories, the world of Hyrule was created by the three golden goddesses: Din, Farore, and Nayru.[28] Before departing, the goddesses left a sacred artifact called the Triforce, which could grant powers to the user. It physically manifests itself as three golden triangles in which each embodies one of the goddesses' virtues: Power, Courage, and Wisdom.[29] However, because the Triforce has no will of its own and it can not judge between good and evil, it will grant any wish indiscriminately.[30][31] Because of this, it was placed within an alternate world called the 'Sacred Realm' or the 'Golden Land' until one worthy of its power and has balanced virtues of Power, Wisdom, and Courage in their heart could obtain it, in its entirety. If a person is not of a balanced heart, the triforce part that the user mostly believes in will stay with that person and the remainder will seek out others. In order to master and control the triforce as a whole, the user must get the other parts found in other individuals and bring them together to reunite them. The Sacred Realm can itself be affected by the heart of those who enters it: those who are pure will make it a paradise, while those who are evil will transform it into a dark realm.[32]  In Skyward Sword, the Triforce was sought by the Demon King Demise,[33] an eternal being that had conquered time itself.[34] After a long battle against the goddess Hylia, guardian of the Triforce, Demise was sealed away within her temple.[29][35] Hylia, placing the Hylians on a floating island (called Skyloft) in the sky to protect them, orchestrated a means to stop the demon from escaping: creating the Goddess Sword (later becoming the Master Sword) for her chosen hero[36] and discarding her divinity to be reborn among the people of Skyloft.[37] In time, Zelda and Link (the reborn Hylia and her predestined warrior) enacted the goddess's plan and Demise was destroyed, but he vowed that his rage would be reborn and forever plague those descended from Link and Zelda.[38] Following the establishment of Hyrule Kingdom, Demise's prophecy came to fruition in Ocarina of Time, when Ganondorf's attempt to get the Triforce scattered it with him gaining the Triforce of Power. The Triforce of Wisdom ended up with the Hylian princesses descended from Zelda, each named after her, while the Triforce of Courage is passed to a youth named Link across generations. While the Triforces of Power and Wisdom have been part of the series since the original The Legend of Zelda, it was only in Zelda II: The Adventure of Link that the Triforce of Courage was first introduced, being obtained by Link at the end of his quest. The Triforce, or even a piece of it, is not always distributed as a whole. Such as in The Wind Waker, Link must find all the pieces (called Triforce Shards) of the Triforce of Courage before he can return to Hyrule. Even in the original The Legend of Zelda, Zelda breaks her Triforce of Wisdom into 8 pieces for Link to find, before she was captured by Ganon.  Fictional chronology The Legend of Zelda story chronology[39][40]  Skyward Sword The Minish Cap Four Swords Ocarina of Time The Hero is Defeated The Hero is Victorious Child Era Adult Era A Link to the Past Link's Awakening Oracle of Seasons & Ages A Link Between Worlds Tri Force Heroes The Legend of Zelda The Adventure of Link Majora's Mask Twilight Princess Four Swords Adventures The Wind Waker Phantom Hourglass Spirit Tracks Breath of the Wild Tears of the Kingdom The chronology of the Legend of Zelda series was a subject of much debate among fans until an official timeline was released within the Hyrule Historia collector's book, first released in Japan in December 2011.[41][42] Prior to its release, in a 2003 interview, series creator Shigeru Miyamoto confirmed the existence of an internal document which connected all the games, with series producer Eiji Aonuma later revealing in 2010 the confidential nature of this document, which only himself, Miyamoto, and the director of each game had access to.[43][44]  In-game content, marketing material, and developer statements once partially established a timeline of the released installments: the original The Legend of Zelda was followed by Zelda II: The Adventure of Link as a direct sequel, which takes place several years later;[45][46] A Link to the Past is a prequel to the previous two games,[47][48][49] and is followed by Link's Awakening;[50][51] Ocarina of Time is a prequel to A Link to the Past and takes the story many centuries back - according to character designer Satoru Takizawa, it was meant to implicitly tell the story of the Imprisoning War,[52][53] and was followed by Majora's Mask as a direct sequel, set a few months later;[54] Four Swords, upon its release, was considered the oldest tale in the series's chronology, predating Ocarina of Time;[55] The Wind Waker takes place in one of the parallel timelines that emerged from Ocarina of Time, more than a century later, in the 'adult era';[56][57] Four Swords Adventures, upon its release, was considered to be a direct sequel to Four Swords, set sometime after its events;[55] The Minish Cap is a prequel to Four Swords, telling of the origins of villain Vaati and the creation of the Four Sword;[58] Twilight Princess takes place in another of the parallel timelines that emerged from Ocarina of Time, more than a century later, in the 'child era';[56][57] Phantom Hourglass is a direct sequel to The Wind Waker,[59] and is followed by Spirit Tracks, which is set about a century later on a land far away from the setting of The Wind Waker.[60] Skyward Sword precedes The Minish Cap, telling the story of the creation of the Master Sword.[61][62] A Link Between Worlds takes place six generations after A Link to the Past, and features the Triforce being reunited, and Ganon being resurrected;[63] Tri Force Heroes is a direct sequel to A Link Between Worlds, which takes place several years later;[64][65] Breath of the Wild and its direct sequel, Tears of the Kingdom take place after all previous games in the series, without specifying a direct connection to any of the three timeline branches.[40]  In the early 2000s, Nintendo of America released a timeline on the official website of the series as one of the possible interpretation of the events from all entries released up to that point, featuring a single protagonist named Link, the 'Hero of Time' from its first adventure in Ocarina of Time. It was followed by Majora's Mask, A Link to the Past, Oracle of Seasons, Oracle of Ages, the original The Legend of Zelda, Zelda II: The Adventure of Link, and finally Link's Awakening.[66] In 2011, series translator Daniel Owsen revelead that, at one point, his coworkers at Nintendo of America and him conceived another complete timeline and intended to make it available online, but the Japanese series developers rejected the idea so that the placement of each game would be kept open to the imagination of the players.[67]  On December 21, 2011, to celebrate 25th anniversary of the series, the Hyrule Historia art book was published by Shogakukan, which contained an official timeline of the fictional chronology of the series up to that point.[41] This timeline subsequently posits that following Ocarina of Time, it splits into three alternate routes: in one, Link fails to defeat Ganon, leading into the Imprisoning War and A Link to the Past, Oracle of Seasons and Oracle of Ages, Link's Awakening (A Link Between Worlds and Tri Force Heroes were released after the timeline), The Legend of Zelda and The Adventure of Link. In the second and third, Link is successful, leading to a timeline split between his childhood (when Zelda sends him back in time so he can use the wisdom he has gained to warn Zelda in the past of the horrifying fate of Hyrule) and adulthood (where the Zelda from the future lives on to try and rebuild the kingdom). His childhood continues with Majora's Mask, followed by Twilight Princess and Four Swords Adventures. The timeline from his adult life continues into Wind Waker, Phantom Hourglass and Spirit Tracks.[41]  In 2018, Nintendo revealed Breath of the Wild's timeline placement after all previous games in the series, without specifying a connection to any of the three timeline branches. Aonuma and Breath of the Wild director, Hidemaro Fujibayashi, justified the vague placement with the previous idea of keeping it open to players' imaginations.[40] Nintendo also moved Link's Awakening to take place before Oracle of Seasons and Oracle of Ages.[40] In November 2020, Nintendo released Hyrule Warriors: Age of Calamity, and marketed the game as a prequel to Breath of the Wild, being set 100 years before.[68] However, the events of Age of Calamity diverged from the backstory established in Breath of the Wild, creating an alternate timeline separate from it.[69]"
}
