{ "text":"The Fender Telecaster, colloquially known as the Tele /ˈtɛli/,[1] is an electric guitar produced by Fender. Together with its sister model the Esquire, it was the world's first mass-produced, commercially successful[note 1] solid-body electric guitar. Its simple yet effective design and revolutionary sound broke ground and set trends in electric guitar manufacturing and popular music. Introduced for national distribution as the Broadcaster[2] in the autumn of 1950 as a two-pickup version of its sister model, the single-pickup Esquire, the pair were the first guitars of their kind manufactured on a substantial scale. A trademark conflict with a rival manufacturer Gretsch Broadkaster led to the guitar being renamed in 1951. Initially, the Broadcaster name was simply cut off of the labels placed on the guitars (leading to a limited run of nameless guitars known as 'No-casters') and later in 1951, the final name of Telecaster was applied to the guitar to take advantage of the advent of television. The Telecaster quickly became a popular model, and has remained in continuous production since its first incarnation. Like the three-pickup Stratocaster which followed it in 1954, the Telecaster is a versatile guitar and has been used in many genres, including country, reggae, rock, pop, folk, soul, blues, jazz, punk, metal, alternative, indie rock, and R&B. The base model has always been available, and other than a change to the pickup selector switch configuration, a thinning of the neck, and a few variations on the bridge design, it has remained mostly unchanged from the 1950s. Several variant models have been produced over the years including those with different pickup configurations and electronics, semi-hollow body designs, and even a twelve string model. Overall design The archetypical Fender Telecaster is a solid-body electric guitar with a flat asymmetric single-cutaway body; the body is usually made from alder or swamp ash. The neck is usually made from maple and attached to the body with screws (though characteristically referred to as a 'bolt-on neck') and has a distinctive small headstock with six tuning pegs mounted inline along a single side; the fingerboard may be maple or another wood, e.g. rosewood, and has at least twenty-one frets. The Telecaster's body is front-routed for electronics; the bridge pickup is mounted in a metal plate attached to the guitar's bridge, other pickups are mounted in a plastic pickguard, and the controls are mounted in a metal plate on the lower bout of the guitar. Most Telecasters have two single-coil pickups, a pickup selector switch, a single volume control and a single tone control. Fixed bridges are almost universal, and the original design has three individually adjustable dual-string saddles whose height and intonation can be set independently.[3] (Many newer models have six saddles.) The output jack is mounted on the edge of the lower bout of the guitar. Many different colors have been available. The Telecaster's scale length is 25.5 inches (64.8 cm).[4] There have been minor changes to the design over the years and models with features that differ from the archetypical design. However, the essential character of the design has remained constant.[5] Telecaster body, showing absence of contouring and general symmetry apart from cutaway, two single-coil pickups and controls Body and electronics Telecaster headstock, with six inline tuning pegs (machine heads) down one side Headstock Telecaster bridge showing three independently adjustable saddles and bridge pickup Detail of the bridge Origins The Fender Telecaster was developed by Leo Fender in Fullerton, California, in 1950. In the period roughly between 1932 and 1949, several craftsmen and companies experimented with solid-body electric guitars, but none had made a significant impact on the market. Leo Fender's Telecaster was the design that made bolt-on neck, solid body guitars viable in the marketplace.[3] Fender had an electronics repair shop called Fender's Radio Service where he first repaired, then designed, amplifiers and electromagnetic pickups for musicians — chiefly players of electric semi-acoustic guitars, electric Hawaiian lap steel guitars, and mandolins. Players had been 'wiring up' their instruments in search of greater volume and projection since the late 1920s, and electric semi-acoustics (such as the Gibson ES-150) had long been widely available. Tone had never, until then, been the primary reason for a guitarist to go electric, but in 1943, when Fender and his partner, Clayton Orr 'Doc' Kauffman, built a crude wooden guitar as a pickup test rig, local country players started asking to borrow it for gigs.[6] It sounded bright and sustaining.[citation needed] Fender's operations expanded to include a line of lap steel guitars, and several of the features of those instruments would be borrowed for a new electric solid-bodied guitar. In 1949, he began prototyping the new instrument.[7] Though it was long understood that solid construction offered great advantages in electric instruments (and by the 1930s, Audiovox had offered a solid-body makeshift electric guitar), no commercial solid-body had ever caught on. Leo felt that it could be successfully done. It was designed in the spirit of the solid-body Hawaiian guitars manufactured by Rickenbacker — small, simple units made of Bakelite and aluminum with the parts bolted together — but with wooden construction. (Rickenbacker, then spelled 'Rickenbacher', also offered a solid Bakelite-bodied electric Spanish guitar in 1935 that seemed to presage details of Fender's design.) Most development guitars were discarded by Fender, but two prototypes survived destruction. An earlier 2-piece pine example was built in summer of 1949 with a headstock design borrowed from the company's lap steels, but otherwise possessing most of the features of what would become the Esquire (as the neck pickup had not been added at this stage). The second prototype from later that year featured an ash body and the final headstock design.[8] The bridge pickup was based on a modified version of the company's Champion lap steel guitar's pickup.[9] The new model had not been made available for the 1949 NAMM Show and Fender's boss of sales, Don Randall, complained that other manufacturers had featured guitars with multiple pickups.[10] Telecaster evolution 1st prototype (1949) Broadcaster (1950) 'Nocaster' (1951) Precision Bass (1951, reissue) Telecaster (1952) Esquire (1954) 1950 The initial single-pickup production model appeared as the Fender Esquire in 1950.[11] Ash and maple were used to construct the body and neck respectively and the guitar came in one color — blond.[12][13] It was priced at $139.95 (equivalent to $1,578 in 2022).[10] Fewer than fifty guitars were originally produced under that name,[14] and most were replaced under warranty because of early manufacturing problems. In particular, the Esquire necks had no truss rod and many were replaced due to bent necks. Later in 1950, this single-pickup model was discontinued, and a two-pickup model was renamed the Broadcaster. From this point onward all Fender necks incorporated truss rods. The Esquire was reintroduced in 1951 as a single pickup variant, at a lower price.[15] 1951 As a result of legal action from the Gretsch company over the guitar's name, the Broadcaster (Gretsch already had the 'Broadkaster' name registered for a line of drums), factory workers simply snipped the 'Broadcaster' name from its existing stock of decals, so guitars with these decals are identified simply as 'Fender', without any model name. The term Nocaster was later coined by collectors to denote these transitional guitars that appeared without a model name on the headstock. Since they were manufactured in this form for 8–9 months in 1951, original Nocasters are highly prized by collectors. There are no official production numbers, but experts estimate that fewer than 500 Nocasters were produced. Fender has since registered Nocaster as a trademark to denote its modern replicas of this famous rarity. Around September 1951, Fender renamed the guitar to Telecaster [16] and started placing these decals on the headstock. Debuting with a transparent butterscotch finish, single ply 'Blackguard', maple neck with walnut back stripe, the Telecaster would go on to become the most successfully mass-produced electric guitar in history. In 1951, Fender released the innovative and musically influential Precision Bass as a similar looking stable-mate to the Telecaster. This body style was later released as the Fender Telecaster Bass in 1968 after the Precision Bass had been changed in 1957 to make it more closely resemble the Fender Stratocaster guitar. This double cut away style was the shape that influenced how the Fender Stratocaster was created.[17] At the time Leo Fender began marketing the newly designed Stratocaster in 1954,[18] he expected it to replace the Blackguard Telecaster,[19] but the Telecaster's many virtues and unique musical personality have kept it in demand to the present day. 1952 By 1952 Leo Fender was clear of any patent or naming infringements, and the Fender company began producing the Telecaster guitar in larger numbers. These early models produced between 1950 and 1954 would become known as Blackguards.[20] In late 1952, Fender made several changes to the circuitry of the guitar. First, a true tone control knob was installed, that could be used to alter the tone from bass-heavy (in the 0 position) to treble-heavy (in the 10 position). The first position stayed the same as before, with the neck pickup in 'dark circuit' treble-cut mode. In this position, the tone knob was disabled. The middle position turned off the dark circuit, and turned on the tone control knob for the neck pickup. The third position selected the bridge pick-up alone, again with an active tone control knob. Although this provided the player with a proper tone control, the change also made it impossible to blend the signal from both pickups. In late 1967 Fender again modified the circuit. They removed the 'dark circuit' from the first position, and installed what has become the standard twin pickup switching system: neck pickup alone with tone control in the first position, both pickups together with the tone control in the middle position and in the third position the bridge pickup alone with the tone control.[21] Construction Leo Fender's simple and modular design was both geared to mass production and simplified servicing of broken guitars.[22] Rather than being constructed individually as in traditional luthiery, instruments were produced quickly and inexpensively from components on an assembly line. The bodies were bandsawn and routed from slabs, rather than hand-carved individually, as with other guitars made at the time, such as Gibsons.[23] Fender did not use the traditional hide-glued set-in neck, but rather a bolt-on neck (which is actually attached using screws). This simple but crude production method also allowed the neck to be easily removed and serviced, or quickly replaced entirely.[24] In addition, the classic Telecaster neck was fashioned from a single piece of maple without a separate fingerboard, its frets slid into a groove cut directly into the wood.[23] The very design of the headstock (inspired by Croatian instruments, according to Leo Fender) followed that simplicity principle: it is very narrow, since it was cut in a single piece of wood (without glued 'wings'). Nonetheless, it is very effective, as the six strings are kept straight behind the nut, keeping the guitar in tune. While this has changed over time with new reincarnations of the guitar,[25] this was a highly unorthodox approach in its day as guitars traditionally featured rosewood or ebony fingerboards glued onto mahogany necks. The electronics were easily accessed for repair or replacement through a removable control plate, a great advantage over the construction of the then-predominant hollow-body instruments, in which the electronics could be accessed only through the sound holes. In its classic form, the guitar is simply constructed, with the neck and fingerboard comprising a single piece of maple, screwed to an ash or alder body inexpensively jigged with flat surfaces on the front and back. The hardware includes two single coil pickups controlled by a three-way selector switch, and one each of volume and tone controls. The pickguard was first Bakelite, soon thereafter it was celluloid (later other plastics), screwed directly onto the body with five (later eight) screws. The bridge has three adjustable saddles, with strings doubled up on each. In its original design nearly all components are secured using only screws (body, neck, tuners, bridge, scratchplate, pickups to body, control plate, output socket), with glue used to secure the nut and solder used to connect the electronic components. With the introduction of the truss rod, and later a rosewood fingerboard, more gluing was required during construction. The guitar quickly gained a following, and soon other, more established guitar companies (such as Gibson, whose Les Paul model was introduced in 1952, and later Gretsch, Rickenbacker, and others) began working on wooden solid-body production models of their own. A Telecaster in 'Paisley Red' (originally released during 1968–69)[26] The Telecaster has always had a three-position selector switch to allow for different pickup configurations, as well as two knobs for controlling volume and tone. However, different eras had different functions for these controls. The original switch and knob configuration was used from 1950 to 1952. The first position (switch towards neck) activated the neck pickup with treble tone cut, which produced a muffled, bass-heavy tone (sometimes called the 'dark circuit'). The middle position selected the neck pickup without the treble cut, giving it a fuller sound, and in the third position had both pickups together and activated the tone knob. On these models, the tone knob acted as a blending knob, with the '0' position using only the bridge pickup, blending to a 50/50 neck/bridge mix in the '10' position. The first knob functioned normally as a master volume control.[21] Pickguards were exclusively black until 1955. The same year, the serial number was moved from the bridge to the neck plate.[1] Typical modern Telecasters (such as the American Standard version) incorporate several details different from the classic form. They typically feature 22 frets (rather than 21) and truss rod adjustments are made at the headstock end, or the body end depending on the model (typically at the head-stock in newer models). The body end requires removal of the neck.[25] The Telecaster sound The Telecaster is popular because of its ability to produce both a bright, rich cutting tone (the typical Telecaster country twang) and a mellow, warm, bluesy jazz tone depending on the selected pickup, respectively 'bridge' pickup or 'neck' pickup, and by adjusting the tone control. This makes the Telecaster a versatile instrument that can be used for different musical styles and sounds, allowing performers to change styles and sounds without changing instruments. The bridge pickup has more windings than the neck pickup, hence producing higher output, which compensates for a lower amplitude of vibration of the strings at the bridge position. At the same time, a capacitor between the slider of the volume control and the output allows treble sounds to bleed through while damping mid and lower ranges.[27][better source needed] Slanting the bridge pickup also increased the guitar's treble response.[7] The solid body allows the guitar to deliver a clear and sustaining amplified version of the strings' sound;[1] this was an improvement over previous electric guitar designs, whose resonant hollow bodies made them prone to unwanted acoustic feedback when volume was increased. These design elements intentionally allowed guitarists to emulate steel guitar sounds, as well as 'cut through' and be heard in roadhouse Honky-Tonk and big Western Swing bands, initially making this guitar particularly useful in country music. Since this, Fender has developed even more in the way of pickups and tones for the Telecaster, with changes from Alnico III magnets to Alnico V magnets.[9][28]"}