{
    "text": "Lasagna(US: /ləˈzɑːnjə/, also UK: /ləˈzænjə/, [1] Italian: [laˈzaɲɲa] also known as lasagne, Italian: [laˈzaɲɲe]) is a type of pasta, possibly one of the oldest types, [2] made of very wide, flat sheets.Either term can also refer to an Italian dish made of stacked layers of lasagna alternating with fillings such as ragù(ground meats and tomato sauce), béchamel sauce, vegetables, cheeses(which may include ricotta, mozzarella, and parmesan), and seasonings and spices.[3] The dish may be topped with grated cheese, which becomes melted during baking.Typically cooked pasta is assembled with the other ingredients and then baked in an oven.The resulting baked pasta is cut into single - serving square or rectangular portions.Origins and history Lasagna originated in Italy during the Middle Ages.The oldest transcribed text about lasagna appears in 1282 in the Memoriali Bolognesi('     Bolognesi Memorials '), in which lasagna was mentioned in a poem transcribed by a Bolognese notary;[4][5] while the first recorded recipe was set down in the early 14th-century Liber de Coquina (The Book of Cookery).[6] It bore only a slight resemblance to the later traditional form of lasagna, featuring a fermented dough flattened into thin sheets, boiled, sprinkled with cheese and spices, and then eaten with a small pointed stick.[7] Recipes written in the century following the Liber de Coquina recommended boiling the pasta in chicken broth and dressing it with cheese and chicken fat. In a recipe adapted for the Lenten fast, walnuts were recommended.[7] Variations Pasta Mass-produced lasagne with a ruffled edge is called lasagna riccia, doppio festone, sciabò and sciablò.[8] In the Veneto, factory-produced lasagne are called bardele or lasagnoni.[8] Narrower lasagne are mezze lasagne, and if with a ruffled edge, mezze lasagne ricche.[8] Similar pastas are the narrower lasagnette and its longer cousin, the lasagnotte (cappellasci [sic] in Liguria[8][9]), as well as the sagne of Salento (the '     heel ' of the Italian '     boot ')[8] and lagana in the remainder of Apulia.[8] Dish The lasagna of Naples, lasagne di carnevale, is layered with local sausage, small fried meatballs, hard-boiled eggs, ricotta and mozzarella cheeses, and sauced with a Neapolitan ragù, a meat sauce.[10] Lasagne al forno, layered with a thicker ragù and béchamel sauce and corresponding to the most common version of the dish outside Italy, is traditionally associated with the Emilia-Romagna region of Italy. Here, and especially in its capital, Bologna, layers of lasagna are traditionally green (the colour is obtained by mixing spinach or other vegetables into the dough)[11] and served with ragù (a thick sauce made from onions, carrots, celery, finely ground pork and beef, butter, and tomatoes),[12][13] bechamel and Parmigiano-Reggiano cheese. In other regions, lasagna can be made with various combinations of ricotta or mozzarella cheese, tomato sauce, meats (such as ground beef, pork or chicken), and vegetables (such as spinach, zucchini, olives, mushrooms), and the dish is typically flavoured with wine, garlic, onion, and oregano. In all cases, the lasagne are baked (al forno). Traditionally pasta dough prepared in Southern Italy used semolina and water; in the northern regions, where semolina was not available, flour and eggs were used. In modern Italy, since the only type of wheat allowed for commercially sold pasta is durum wheat, industrial lasagna are made of semolina from durum wheat.[14] Nonetheless, in the north and especially in Emilia-Romagna, the tradition of egg-based dough remains popular for artisanal and homemade productions. Etymology In Ancient Rome, there was a dish similar to a traditional lasagna called lasana or lasanum (Latin for '     container ' or '     pot ') described in the book De re coquinaria by Marcus Gavius Apicius,[15] but the word could have a more ancient origin. The first theory is that lasagna comes from Greek λάγανον (laganon), a flat sheet of pasta dough cut into strips.[16][17][18][19] The word λαγάνα (lagana) is still used in Greek to mean a flat thin type of unleavened bread baked for the holiday Clean Monday. Another theory is that the word lasagna comes from the Greek λάσανα (lasana) or λάσανον (lasanon) meaning '     trivet ', '     stand     for a pot ' or '     chamber pot '.[20][21][22] The Romans borrowed the word as lasanum, meaning '     cooking pot '.[23] The Italians used the word to refer to the cookware in which lasagna is made. Later the food took on the name of the serving dish. Another proposed link or reference is the 14th-century English dish loseyn[24] as described in The Forme of Cury, a cookbook prepared by '     the chief Master Cooks of King Richard II ',[25] which included English recipes as well as dishes influenced by Spanish, French, Italian, and Arab cuisines.[26] This dish has similarities to modern lasagna in both its recipe, which features a layering of ingredients between pasta sheets, and its name. An important difference is the lack of tomatoes, which did not arrive in Europe until after Columbus reached the Americas in 1492. The earliest discussion of the tomato in European literature appeared in a herbal written in 1544 by Pietro Andrea Mattioli,[27] while the earliest cookbook found with tomato recipes was published in Naples in 1692, but the author had obtained these recipes from Spanish sources.[27] As with most other types of pasta, the Italian word is a plural form: lasagne meaning more than one sheet of lasagna, though, in many other languages, a derivative of the singular word lasagna is used for the popular baked pasta dish. When referring to the baked dish, regional usage in Italy favours the plural form lasagne in the north of the country and the singular lasagna in the south.[28] The former plural usage has influenced the usual spelling found in British English, while the southern Italian singular usage has influenced the spelling often used in American English.[28] Both lasagne and lasagna are used as singular non-count (uncountable) nouns in English.[29]'"
  }