{
  "title": "Order Processing Workflow with Lambda Durable Functions",
  "description": "Production-ready 17-step order processing workflow using Lambda Durable Functions with automatic checkpointing, long-running waits, and state persistence",
  "language": "Node.js",
  "level": "300",
  "framework": "AWS SAM",
  "introBox": {
    "headline": "How it works",
    "text": [
      "This pattern demonstrates a production-ready order processing workflow with 17 steps using Lambda Durable Functions.",
      "The workflow includes validation, payment processing, fraud checks, credit checks (for high-value orders), inventory management, and shipping coordination.",
      "Durable execution enables long-running waits (5 minutes for warehouse processing, 3 minutes for carrier pickup) without consuming compute resources.",
      "Each step is automatically checkpointed, allowing the workflow to survive interruptions and resume from the last successful step.",
      "The pattern uses a dual-function architecture: async durable function for order processing and sync non-durable function for real-time status queries.",
      "Order state is persisted in DynamoDB with real-time status updates throughout the 17-step workflow."
    ]
  },
  "gitHub": {
    "template": {
      "repoURL": "https://github.com/aws-samples/serverless-patterns/tree/main/lambda-durable-order-processing-sam",
      "templateURL": "serverless-patterns/lambda-durable-order-processing-sam",
      "projectFolder": "lambda-durable-order-processing-sam",
      "templateFile": "template.yaml"
    }
  },
  "resources": {
    "bullets": [
      {
        "text": "Lambda Durable Functions Documentation",
        "link": "https://docs.aws.amazon.com/lambda/latest/dg/durable-functions.html"
      },
      {
        "text": "Durable Execution SDK for JavaScript",
        "link": "https://github.com/aws/aws-durable-execution-sdk-js"
      },
      {
        "text": "AWS Blog: Build multi-step applications with Lambda durable functions",
        "link": "https://aws.amazon.com/blogs/aws/build-multi-step-applications-and-ai-workflows-with-aws-lambda-durable-functions/"
      }
    ]
  },
  "deploy": {
    "text": [
      "Note: Lambda Durable Functions are currently available in us-east-2 (Ohio) region only.",
      "cd src && npm install && cd ..",
      "sam build",
      "sam deploy --guided --region us-east-2"
    ]
  },
  "testing": {
    "text": [
      "See the GitHub repo for detailed testing instructions."
    ]
  },
  "cleanup": {
    "text": [
      "Delete the stack: <code>sam delete --region us-east-2</code>."
    ]
  },
  "authors": [
    {
      "name": "Abhishek Agawane",
      "image": "https://drive.google.com/file/d/1E-5koDaKEaMUtOctX32I9TLwfh3kgpAq/view?usp=drivesdk",
      "bio": "Abhishek Agawane is a Security Consultant at Amazon Web Services with more than 8 years of industry experience. He helps organizations architect resilient, secure, and efficient cloud environments, guiding them through complex challenges and large-scale infrastructure transformations. He has helped numerous organizations enhance their cloud operations through targeted optimizations, robust architectures, and best-practice implementations.",
      "linkedin": "https://www.linkedin.com/in/agawabhi/"
    }
  ]
}
