{
  "title": "S3 to MediaCovert via AWS Lambda",
  "description": "Automate the trans-codification of new video files on Amazon S3, leveraging AWS Lambda and AWS Elemental MediaConvert. The transcoded video will go to another S3 bucket for future streaming or further processing.",
  "language": "Python",
  "level": "200",
  "framework": "SAM",
  "introBox": {
    "headline": "How it works",
    "text": [
      "This sample project demonstrates how to use Lambda for triggering trans-codification jobs on AWS Elemental MediaCovert. This pattern leverages the integration between Amazon S3 and AWS Lambda for triggering Lambda functions",
      "Each time you upload a video file to the input S3 bucket, a Lambda function is triggered. The function gets invocation event, process it, and creates a job in AWS Elemental MediaConverter. The settings of the job are in the job.json file which is part of the lambda deployment package.",
      "The output of the job is a transcoded video which is saved in the output S3 bucket.",
      "This pattern deploys two S3 buckets, one AWS Lambda function and the required IAM Roles for making AWS Lambda capable of creating AWS Elemental MediaConvert jobs and write logs in Amazon CloudWatch Logs. AWS Lambda function is written in Python 3.9."
    ]
  },
  "gitHub": {
    "template": {
      "repoURL": "https://github.com/aws-samples/serverless-patterns/tree/main/s3-lambda-mediaconvert",
      "templateURL": "serverless-patterns/s3-lambda-mediaconvert",
      "projectFolder": "s3-lambda-mediaconvert",
      "templateFile": "template.yaml"
    }
  },
  "resources": {
    "bullets": [
      {
        "text": "Video on Demand on AWS",
        "link": "https://aws.amazon.com/solutions/implementations/video-on-demand-on-aws/"
      },
      {
        "text": "AWS Elemental Media Convert",
        "link": "https://aws.amazon.com/mediaconvert/"
      }
    ]
  },
  "deploy": {
    "text": [
      "sam deploy --guided --capabilities CAPABILITY_NAMED_IAM"
    ]
  },
  "testing": {
    "text": [
      "See the GitHub repo for detailed testing instructions."
    ]
  },
  "cleanup": {
    "text": [
      "Delete the stack: <code>sam delete</code>.",
      "See the GitHub repo for detailed cleanup instructions."
    ]
  },
  "authors": [
    {
      "name": "Aryam Gutierrez",
      "image": "https://d38h74djm40icj.cloudfront.net/agutierrezl-image.png",
      "bio": "Aryam is a Solutions Architect at Amazon Web Service based in Spain",
      "linkedin": "aryaml",
      "twitter": "@aryam_gl"
    }
  ]
}
