{
  "title": "Exponential Backoff in SQS Processing with Step Functions and EventBridge Pipes",
  "description": "This pattern demonstrates a seamless integration between an SQS queue and AWS Step Functions using Amazon EventBridge Pipes. It enables direct routing of messages from an SQS queue into a Step Functions state machine, which orchestrates the processing flow and manages AWS Lambda invocation errors. When Lambda encounters an error, the erroneous message is directed to an SQS Dead Letter Queue (DLQ) for further inspection or reprocessing.",
  "language": "Python",
  "level": "200",
  "framework": "SAM",
  "introBox": {
    "headline": "How it works",
    "text": [
      "Messages sent to the SQS queue are routed through EventBridge Pipes to a Step Functions state machine. The state machine manages message processing and invokes a Lambda function, which is intentionally set with a reserved concurrency of 0 to simulate throttling.",
      "When errors, such as throttling, occur in the Lambda function, the state machine employs an exponential backoff retry strategy that starts with a 5-second delay, doubling this delay after each subsequent retry, for up to 6 maximum retry attempts. If all retry attempts are exhausted, the message is directed to a Dead Letter Queue (DLQ) for further analysis."
    ]
  },
  "gitHub": {
    "template": {
      "repoURL": "https://github.com/aws-samples/serverless-patterns",
      "templateURL": "serverless-patterns/sqs-stepfunctions-pipes-pattern",
      "projectFolder": "sqs-stepfunctions-pipes-pattern",
      "templateFile": "template.yaml"
    }
  },
  "resources": {
    "bullets": [
      {
        "text": "Amazon Simple Queue Service (SQS)",
        "link": "https://docs.aws.amazon.com/step-functions/latest/dg/welcome.html"
      },
      {
        "text": "AWS Step Functions",
        "link": "https://aws.amazon.com/step-functions/"
      },
      {
        "text": "AWS Lambda",
        "link": "https://docs.aws.amazon.com/lambda/latest/dg/welcome.html"
      },
      {
        "text": "Amazon EventBridge Pipes",
        "link": "https://docs.aws.amazon.com/eventbridge/latest/userguide/eb-pipes.html"
      }
    ]
  },
  "deploy": {
    "text": [
      "sam deploy --guided"
    ]
  },
  "testing": {
    "text": [
      "Retrieve the Queue URL from the outputs of the SAM deployment and send a test message using AWS CLI. Monitor the Step Functions state machine to observe the execution. If the Lambda function fails, check the DLQ for the erroneous message."
    ]
  },
  "cleanup": {
    "text": [
      "To delete the deployed resources, use: sam delete --stack-name YOUR_STACK_NAME. Replace YOUR_STACK_NAME with the name you provided for your stack during deployment."
    ]
  },
  "authors": [
    {
      "name": "Mohammed Atiq",
      "image": "https://i.postimg.cc/N0804zKg/photo.jpg",
      "bio": "Solutions Architect at AWS and Serverless enthusiast.",
      "linkedin": "https://www.linkedin.com/in/mohammed-a-2980151b7"
    }
  ]
}