{
  "title": "Human-in-the-Loop Approval Workflow with Lambda durable functions",
  "description": "Approval workflow that pauses execution while waiting for human decisions, with automatic timeout handling and callback-based resumption",
  "language": "Python",
  "level": "300",
  "framework": "AWS SAM",
  "introBox": {
    "headline": "How it works",
    "text": [
      "This pattern demonstrates a human-in-the-loop approval workflow using Lambda durable functions with callback operations.",
      "The workflow pauses execution using create_callback() while waiting for human approval, incurring no compute charges during the wait period.",
      "If no decision is received within 24 hours, the workflow automatically times out and rejects the request.",
      "When an approver submits a decision via API, the durable function resumes from its checkpoint and processes the result.",
      "The pattern uses DynamoDB to map short UUIDs to callback IDs for clean approval URLs, and SNS to send email notifications with approve/reject links."
    ]
  },
  "gitHub": {
    "template": {
      "repoURL": "https://github.com/aws-samples/serverless-patterns/tree/main/lambda-durable-human-approval-sam",
      "templateURL": "serverless-patterns/lambda-durable-human-approval-sam",
      "projectFolder": "lambda-durable-human-approval-sam",
      "templateFile": "template.yaml"
    }
  },
  "resources": {
    "bullets": [
      {
        "text": "Lambda durable functions Documentation",
        "link": "https://docs.aws.amazon.com/lambda/latest/dg/durable-functions.html"
      },
      {
        "text": "Durable Execution SDK for Python",
        "link": "https://github.com/aws/aws-durable-execution-sdk-python"
      }
    ]
  },
  "deploy": {
    "text": [
      "Note: Lambda durable functions have limited regional availability. Please check the AWS documentation for current regional support.",
      "sam build",
      "sam deploy --guided --region us-east-2"
    ]
  },
  "testing": {
    "text": [
      "See the GitHub repo for detailed testing instructions."
    ]
  },
  "cleanup": {
    "text": [
      "Delete the stack: <code>sam delete --region us-east-2</code>."
    ]
  },
  "authors": [
    {
      "name": "Abhishek Agawane",
      "image": "https://drive.google.com/file/d/1E-5koDaKEaMUtOctX32I9TLwfh3kgpAq/view?usp=drivesdk",
      "bio": "Abhishek Agawane is a Security Consultant at Amazon Web Services with more than 8 years of industry experience. He helps organizations architect resilient, secure, and efficient cloud environments, guiding them through complex challenges and large-scale infrastructure transformations. He has helped numerous organizations enhance their cloud operations through targeted optimizations, robust architectures, and best-practice implementations.",
      "linkedin": "agawabhi"
    }
  ]
}
